import pytest

from prefix_sums import count_zero


@pytest.mark.parametrize(
    "a, requests, expected",
    [
        # Тест 1: Проверка на пустом массиве
        ([], [], []),
        ([], [(0, 0)], [0]),
        # Тест 2: Проверка на массиве без нулей
        ([1, 1, 1, 1], [(0, 4)], [0]),
        # Тест 3: Проверка на массиве только с нулями
        ([0, 0, 0, 0], [(0, 4)], [4]),
        # Тест 4: Проверка на массиве с нулями и ненулевыми числами
        ([1, 0, 0, 1, 0, 1, 0, 1], [(0, 3), (1, 5), (2, 7)], [2, 3, 3]),
        # Тест 5: Проверка на массиве с нулями и ненулевыми числами, где L = R
        ([1, 0, 0, 1, 0, 1, 0, 1], [(3, 3)], [0]),
    ],
)
def test_count_zero(a, requests, expected):
    assert count_zero(a, requests) == expected
